{
    "@metadata": {
        "authors": [
            "Neriah"
        ]
    },
    "apihelp-query+aspaklaryalog-example-byaction": "Example usage of the API to list recent log entries of approved images.",
    "apihelp-query+aspaklaryalog-example-byuser": "Example usage of the API to list log entries performed by a specific user.",
    "apihelp-query+aspaklaryalog-example-simple": "Example usage of the API to list recent entries in the Aspaklarya image review log.",
    "aspaklarya-notification-approved": "Notification message displayed when an image has been approved by a reviewer.\n\nParameters:\n* $1 - The filename of the approved image.",
    "aspaklarya-notification-edited": "Notification message displayed when an image has been edited and needs rechecking.\n\nParameters:\n* $1 - The filename of the edited image.",
    "aspaklarya-notification-removed": "Notification message displayed when an image has been removed from articles.\n\nParameters:\n* $1 - The filename of the removed image.",
    "aspaklarya-queue-approve": "Label for the button to approve an image in the review queue.",
    "aspaklarya-queue-edited": "Label for the button to mark an image as edited in the review queue.",
    "aspaklarya-queue-empty": "Message displayed when there are no images in the review queue.",
    "aspaklarya-queue-error-processing": "Error message displayed when there is an issue processing an image in the review queue.",
    "aspaklarya-queue-file-blocked": "Success message shown when a file page is blocked",
    "aspaklarya-queue-image-removed": "Success message shown when an image is removed from an article. $1 is the page title",
    "aspaklarya-queue-nav-prev": "Label for the button to navigate to the previous page in the image review queue.",
    "aspaklarya-queue-nav-next": "Label for the button to navigate to the next page in the image review queue.",
    "aspaklarya-queue-nav-range": "Text showing the current range of items displayed in the image review queue (e.g., '1-25 of 100').\n\nParameters:\n* $1 - Start of the range (e.g., 1)\n* $2 - End of the range (e.g., 25)\n* $3 - Total number of items (e.g., 100)",
    "aspaklarya-queue-nav-per-page": "Label for the dropdown option to select the number of items to display per page in the image review queue.\n\nParameters:\n* $1 - Number of items per page (e.g., 25)",
    "aspaklarya-queue-nav-go": "Label for the button that submits the form to apply the selected number of items per page in the image review queue.",
    "aspaklarya-queue-notification-error": "Error message shown when a notification fails to send to a user",
    "aspaklarya-queue-notification-sent": "Success message shown when a notification is sent to a user",
    "aspaklarya-queue-page": "Text indicating the page where the image appears.\n\nParameters:\n* $1 - The title of the page where the image is used.",
    "aspaklarya-queue-previously-reviewed": "Notice shown in the queue when an image was previously reviewed.\n\nParameters:\n* $1 - Status of the previous review (approved, removed, or edited)\n* $2 - Timestamp of the previous review\n* $3 - Username of the reviewer",
    "aspaklarya-queue-remove": "Label for the button to remove an image from the review queue and articles.",
    "aspaklarya-queue-requested-by": "Text indicating the user who submitted the image for review.\n\nParameters:\n* $1 - The username of the submitting user.",
    "aspaklarya-queue-success": "Success message displayed after a queue action (e.g., approve, remove, edited) is completed successfully.",
    "aspaklarya-queue-timestamp": "Text indicating when the image was submitted for review.\n\nParameters:\n* $1 - The timestamp of submission (in a human-readable format).",
    "aspaklarya-queue-title": "Title of the special page showing the image review queue.",
    "aspaklarya-review-button": "Label for the button or link to open the image review dialog.",
    "aspaklarya-review-by-reviewer": "Text appended to the previously reviewed message indicating the reviewer of the image.\n\nParameters:\n* $1 - Username of the reviewer.",
    "aspaklarya-review-cancel": "Label for the button to cancel the image review submission dialog.",
    "aspaklarya-review-confirm-no": "Button text to cancel re-review of an image.",
    "aspaklarya-review-confirm-title": "Title of the confirmation dialog for re-reviewing images.",
    "aspaklarya-review-confirm-yes": "Button text to confirm re-review of an image.",
    "aspaklarya-review-error": "Error message displayed when submitting an image for review fails.\n\nParameters:\n* $1 - The specific error message or filename causing the error.",
    "aspaklarya-review-no-images": "Message displayed when there are no images on the current page to submit for review.",
    "aspaklarya-review-no-selection": "Message displayed when no images are selected in the review dialog before submission.",
    "aspaklarya-review-partial-error": "Error message displayed when some images fail to be submitted for review.",
    "aspaklarya-review-previously-reviewed": "Message shown when an image was previously reviewed.\n\nParameters:\n* $1 - Filename of the image\n* $2 - Status of the previous review (approved, removed, or edited)\n* $3 - Timestamp of the previous review",
    "aspaklarya-review-submit": "Label for the button to submit selected images for review.",
    "aspaklarya-review-submitting": "Message displayed while images are being submitted for review.",
    "aspaklarya-review-success": "Success message displayed after an image is successfully submitted for review.",
    "aspaklarya-review-title": "Title of the dialog for submitting images for review.",
    "aspaklarya-review-tooltip": "Tooltip text for the button or link to submit images for review.",
    "aspaklarya-status-approved": "Status label for an approved image",
    "aspaklarya-status-edited": "Status label for an edited image",
    "aspaklarya-status-pending": "Status label for a pending image",
    "aspaklarya-status-removed": "Status label for a removed image",
    "aspaklarya-status-unknown": "Status label for an unknown image status",
    "aspaklaryareview": "Name of the extension, used as the API module name and general identifier.",
    "aspaklaryareview-desc": "{{desc|name=AspaklaryaReview|url=https://github.com/n-michlol/AspaklaryaReview}}\nDescription of the extension for MediaWiki.",
    "echo-category-title-aspaklarya-review": "Category title for Echo notifications related to updates on reviewed images.",
    "echo-pref-tooltip-aspaklarya-review": "Tooltip for the Echo notification preference to enable notifications about reviewed images, whether they need to be rechecked in NetFree, and additional updates.",
    "log-description-aspaklaryareview": "Description of the Aspaklarya image review log, explaining its purpose in the logs interface.",
    "log-name-aspaklaryareview": "Name of the log for Aspaklarya image review actions, shown in the logs list.",
    "logentry-aspaklaryareview-approved": "Log entry message displayed when a user approves an image.\n\nParameters:\n* $1 - Link to the user\n* $2 - Username (for gender handling)\n* $4 - Link to the image.",
    "logentry-aspaklaryareview-edited": "Log entry message displayed when a user marks an image as edited.\n\nParameters:\n* $1 - Link to the user\n* $2 - Username (for gender handling)\n* $4 - Link to the image.",
    "logentry-aspaklaryareview-removed": "Log entry message displayed when a user removes an image from review.\n\nParameters:\n* $1 - Link to the user\n* $2 - Username (for gender handling)\n* $4 - Link to the image.",
    "logentry-aspaklaryareview-submit": "Log entry message displayed when a user submits an image for review.\n\nParameters:\n* $1 - Link to the user\n* $2 - Username (for gender handling)\n* $4 - Link to the image.",
    "notification-link-text-view-file": "Label for the link in notifications to view the file in question.",
    "right-aspaklarya-review": "Description of the user right required to review images in the queue.",
    "right-aspaklarya-review-log": "Description of the user right required to view the Aspaklarya image review log.",
    "version-aspaklarya": "The name of the Aspaklarya extension type as shown in Special:Version",
    "version-aspaklarya-desc": "Description of the Aspaklarya extension type in Special:Version"
}